In [2]:
#Data preparation with pandas
import pandas as pd
import numpy as np

dataset = pd.read_csv('patientData.csv')

dataset

   Gender   Age  Albumin Liver Disease
0  Female  62.0      3.3           Yes
1  Female  65.0      3.2           Yes
2  Female  45.0      3.1            No
3    Male  40.0      4.1            No
4    Male  50.0      NaN           Yes
5  Female  55.0      3.3            No
6    Male   NaN      3.6           Yes
7    Male  67.0      3.8           Yes
8    Male  75.0      3.0            No
9  Female  64.0      3.4           Yes

In [3]:
data_fill = dataset.fillna(0)
data_fill

   Gender   Age  Albumin Liver Disease
0  Female  62.0      3.3           Yes
1  Female  65.0      3.2           Yes
2  Female  45.0      3.1            No
3    Male  40.0      4.1            No
4    Male  50.0      0.0           Yes
5  Female  55.0      3.3            No
6    Male   0.0      3.6           Yes
7    Male  67.0      3.8           Yes
8    Male  75.0      3.0            No
9  Female  64.0      3.4           Yes

In [3]:
data_fill = dataset.fillna({1: 50})
data_fill

   Gender   Age  Albumin Liver Disease
0  Female  62.0      3.3           Yes
1  Female  65.0      3.2           Yes
2  Female  45.0      3.1            No
3    Male  40.0      4.1            No
4    Male  50.0      NaN           Yes
5  Female  55.0      3.3            No
6    Male   NaN      3.6           Yes
7    Male  67.0      3.8           Yes
8    Male  75.0      3.0            No
9  Female  64.0      3.4           Yes

In [5]:
data = pd.Series([0, 1, 2, 3, 4, np.nan, 5, 6, 7, 8])

data.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9    False
dtype: bool

In [6]:
data.notnull()

0     True
1     True
2     True
3     True
4     True
5    False
6     True
7     True
8     True
9     True
dtype: bool

In [7]:
data.dropna()

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
6    5.0
7    6.0
8    7.0
9    8.0
dtype: float64

In [8]:
data

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    NaN
6    5.0
7    6.0
8    7.0
9    8.0
dtype: float64

In [9]:
not_null_data = data.dropna()
not_null_data

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
6    5.0
7    6.0
8    7.0
9    8.0
dtype: float64

In [10]:
data.dropna(inplace=True)

In [11]:
data

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
6    5.0
7    6.0
8    7.0
9    8.0
dtype: float64

In [12]:
import numpy as np
data_dim = pd.DataFrame([ [1,2,3,np.nan], [4,5,np.nan,6], [7, np.nan,np.nan,np.nan], [8, 9, 10, np.nan] ])
data_dim

   0    1     2    3
0  1  2.0   3.0  NaN
1  4  5.0   NaN  6.0
2  7  NaN   NaN  NaN
3  8  9.0  10.0  NaN

In [13]:
data_dim.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [14]:
data_dim.dropna(how = 'all')

   0    1     2    3
0  1  2.0   3.0  NaN
1  4  5.0   NaN  6.0
2  7  NaN   NaN  NaN
3  8  9.0  10.0  NaN

In [15]:
data_dim.dropna(axis=1, how='all')

   0    1     2    3
0  1  2.0   3.0  NaN
1  4  5.0   NaN  6.0
2  7  NaN   NaN  NaN
3  8  9.0  10.0  NaN

In [16]:
data_dim.dropna(axis=1, thresh=2)

   0    1     2
0  1  2.0   3.0
1  4  5.0   NaN
2  7  NaN   NaN
3  8  9.0  10.0

In [17]:
data_dim.dropna(thresh=2)

   0    1     2    3
0  1  2.0   3.0  NaN
1  4  5.0   NaN  6.0
3  8  9.0  10.0  NaN

In [18]:
data_dim

   0    1     2    3
0  1  2.0   3.0  NaN
1  4  5.0   NaN  6.0
2  7  NaN   NaN  NaN
3  8  9.0  10.0  NaN

In [19]:
data_dim_fill = data_dim.fillna(0)
data_dim_fill

   0    1     2    3
0  1  2.0   3.0  0.0
1  4  5.0   0.0  6.0
2  7  0.0   0.0  0.0
3  8  9.0  10.0  0.0

In [20]:
data_dim_fill = data_dim.fillna({1: 3, 2: 6, 3: 8})

In [21]:
data_dim_fill

   0    1     2    3
0  1  2.0   3.0  8.0
1  4  5.0   6.0  6.0
2  7  3.0   6.0  8.0
3  8  9.0  10.0  8.0

In [22]:
data_dim_fill = data_dim.fillna(method='ffill')
data_dim_fill

   0    1     2    3
0  1  2.0   3.0  NaN
1  4  5.0   3.0  6.0
2  7  5.0   3.0  6.0
3  8  9.0  10.0  6.0

In [23]:
data_dim_fill = data_dim.fillna(axis=1, method='ffill')
data_dim_fill

     0    1     2     3
0  1.0  2.0   3.0   3.0
1  4.0  5.0   5.0   6.0
2  7.0  7.0   7.0   7.0
3  8.0  9.0  10.0  10.0

In [24]:
data_dim

   0    1     2    3
0  1  2.0   3.0  NaN
1  4  5.0   NaN  6.0
2  7  NaN   NaN  NaN
3  8  9.0  10.0  NaN

In [25]:
data_dim_fill = data_dim.fillna(data_dim.mean()) #mean perkolom
data_dim_fill

   0         1     2    3
0  1  2.000000   3.0  6.0
1  4  5.000000   6.5  6.0
2  7  5.333333   6.5  6.0
3  8  9.000000  10.0  6.0

In [26]:
#data transformation

data = pd.Series([2,3,10,34,-96,73,-96,-96])
data

0     2
1     3
2    10
3    34
4   -96
5    73
6   -96
7   -96
dtype: int64

In [27]:
data.replace(-96, np.nan)

0     2.0
1     3.0
2    10.0
3    34.0
4     NaN
5    73.0
6     NaN
7     NaN
dtype: float64

In [28]:
new_data = pd.Series([27,-100,30,56])
combine_series = pd.concat([data, new_data], ignore_index=True)
combine_series

0       2
1       3
2      10
3      34
4     -96
5      73
6     -96
7     -96
8      27
9    -100
10     30
11     56
dtype: int64

In [29]:
data_replaced = combine_series.replace([-96, -100], np.nan)
data_replaced

0      2.0
1      3.0
2     10.0
3     34.0
4      NaN
5     73.0
6      NaN
7      NaN
8     27.0
9      NaN
10    30.0
11    56.0
dtype: float64

In [30]:
data_replace = combine_series.replace({-96: np.nan, -100: 0 })
data_replace

0      2.0
1      3.0
2     10.0
3     34.0
4      NaN
5     73.0
6      NaN
7      NaN
8     27.0
9      0.0
10    30.0
11    56.0
dtype: float64

In [44]:
data_number = pd.DataFrame({'english': ['zero','one','two','three','four','five'], 'digits': [0,1,2,3,4,5]})
data_number

  english  digits
0    zero       0
1     one       1
2     two       2
3   three       3
4    four       4
5    five       5

In [47]:
english_to_multiple = {1 : 'yes',2 :'yes'}
english_to_multiple

{1: 'yes', 2: 'yes'}

In [48]:
data_number['valid']=data_number['digits'].map(english_to_multiple)
data_number

  english  digits valid
0    zero       0   NaN
1     one       1   yes
2     two       2   yes
3   three       3   NaN
4    four       4   NaN
5    five       5   NaN

In [58]:
import random

data = random.sample(range(1,100),30)
data

[51,
 8,
 87,
 71,
 22,
 75,
 90,
 85,
 1,
 16,
 77,
 34,
 52,
 56,
 17,
 21,
 97,
 5,
 12,
 64,
 20,
 89,
 46,
 15,
 10,
 33,
 9,
 83,
 57,
 23]

In [59]:
bucket = [1, 25, 35, 60, 80, 100]

cut_data = pd.cut(data, bucket)

cut_data

[(35, 60], (1, 25], (80, 100], (60, 80], (1, 25], ..., (25, 35], (1, 25], (80, 100], (35, 60], (1, 25]]
Length: 30
Categories (5, interval[int64]): [(1, 25] < (25, 35] < (35, 60] < (60, 80] < (80, 100]]

In [60]:
data = pd.Series(list('abcdabcdabcd'))
data

0     a
1     b
2     c
3     d
4     a
5     b
6     c
7     d
8     a
9     b
10    c
11    d
dtype: object

In [61]:
pd.get_dummies(data)

    a  b  c  d
0   1  0  0  0
1   0  1  0  0
2   0  0  1  0
3   0  0  0  1
4   1  0  0  0
5   0  1  0  0
6   0  0  1  0
7   0  0  0  1
8   1  0  0  0
9   0  1  0  0
10  0  0  1  0
11  0  0  0  1